In [1]:
import pandas as pd

C:\Users\Abdul\AppData\Local\Temp\ipykernel_12856\4080736814.py:1: DeprecationWarning:
Pyarrow will become a required dependency of pandas in the next major release of pandas (pandas 3.0),
(to allow more performant data types, such as the Arrow string type, and better interoperability with other libraries)
but was not found to be installed on your system.
If this would cause problems for you,
please provide us feedback at https://github.com/pandas-dev/pandas/issues/54466

  import pandas as pd

In [5]:
df = pd.DataFrame() #to create an empty DataFrame
print(df)

Empty DataFrame
Columns: []
Index: []

Creating DataFrame using python list

In [6]:
l = ["a","b","c","d"]
l

['a', 'b', 'c', 'd']

In [9]:
df2 = pd.DataFrame(l)
print(df2)

   0
0  a
1  b
2  c
3  d

Creating DataFrame using list of list

In [10]:
l2 = [[1,2,3],[4,5,6],[7,8,9]]
l2

[[1, 2, 3], [4, 5, 6], [7, 8, 9]]

In [11]:
df3 = pd.DataFrame(l2)
df3

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

Creating DataFrame using python dictionary

In [12]:
d = {"ID":[11,22,33,44], "SN":[1,2,3,4]}
d

{'ID': [11, 22, 33, 44], 'SN': [1, 2, 3, 4]}

In [13]:
df4 = pd.DataFrame(d)
df4

   ID  SN
0  11   1
1  22   2
2  33   3
3  44   4

Creating DataFrame using list of dictionary

In [14]:
ld = [{"a":1, "b":2}, {"a":3, "b":4}]
ld

[{'a': 1, 'b': 2}, {'a': 3, 'b': 4}]

In [15]:
df5 = pd.DataFrame(ld)
df5

   a  b
0  1  2
1  3  4

In [16]:
ld2 = [{"a":1, "b":2}, {"a":3, "b":4, "c":7}] #it will handle missing values also
ld2

[{'a': 1, 'b': 2}, {'a': 3, 'b': 4, 'c': 7}]

In [17]:
df6 = pd.DataFrame(ld2)
df6

   a  b    c
0  1  2  NaN
1  3  4  7.0

Creating DataFrame using Dictionary of Series

In [18]:
ds = {"ID": pd.Series([1,2,3]), "SN": pd.Series([111,222,333])}
ds

{'ID': 0    1
 1    2
 2    3
 dtype: int64,
 'SN': 0    111
 1    222
 2    333
 dtype: int64}

In [19]:
df7 = pd.DataFrame(ds)
df7

   ID   SN
0   1  111
1   2  222
2   3  333